Revit 2027 API
ContextualHelp.HelpPath Property
The context id, help URL, or help file path.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string HelpPath { get; set; }
Public Property HelpPath As String
	Get
	Set
public:
property String^ HelpPath {
	String^ get ();
	void set (String^ value);
}
member HelpPath : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting the help path to null or empty.
See Also
Reference
ContextualHelp Class
Autodesk.Revit.UI Namespace